
#Область Первая

Перем А;

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    А = 1;

    Если А = 1 Тогда

        Б = "Многострочная
             | Строка
             | c " + "конкатенацией";

    ИначеЕсли А = Вторая() Тогда

        // Комментарий

    КонецЕсли;

    Попытка
        Сообщить(А);
    Исключение
        А  = Б;
    КонецПопытки

КонецПроцедуры


&НаСервере
Функция Вторая()

    А = Новый Массив;
    А.Добавить(20);
    Для Каждого Элемент Из А Цикл
        А.Добавить("1");
    КонецЦикла;

    Возврат А.Количество();

КонецФункции
