
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НичегоНеДелать();
	ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ОбщийМодульВызовСервера.ПроцедураОбщегоМодуляВызовСервера();
	Команда1НаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	ОбщийМодульПовтИспВызов.ОбщегоМодуляПовтИспВызов();
	ОбщийМодульПовтИспСеанс.ПроцедураОбщегоМодуляПовтИспСеанс();
	ОбщийМодульПолныеПрава.ПроцедураОбщегоМодуляПолныеПрава();
	ПроцедураГлобальногоОбщегоМодуля();
	ФоновыеЗадания.Выполнить("ПростойОбщийМодуль.ФоновоеЗадание1");
КонецПроцедуры