Перем Б;

Процедура Инициализация()

	Б
	=
	Новый
	Массив
	;

	Б
	.
	Добавить
	(
	Новый
	Массив
	);
КонецПроцедуры

Процедура Присвоение()

	А
	=
	1;

	А
	=
	1
	+
	1;

	А
	=
	1
	=
	1
	;
	А
	=
	1
	И
	1;

	А
	=
	Б
	.
	Количество
	(
	)
	И
	ЭтогоМодуля
	(
	)
	=
	1
	ИЛИ
	ВернетИстина
	(
	)
	;

	А
	=
	"1
	|"
	+
	ВернетСтроку
	(
		ЭтогоМодуля
		(
		)
	)
	+
	"1"
	+
	Б;

	Запрос
		=
		Новый
		Запрос;

	Запрос
	.
	Текст
	=
	"ВЫБРАТЬ
	|	1 КАК Поле1
	| "
	+
	ВернетСтроку
	(
	1
	)
	+
	";";

	;


КонецПроцедуры

Функция ЭтогоМодуля()

	Возврат
	2
	;

КонецФункции

Функция ВернетСтроку(Парам)

	Возврат
	"2"
	;
КонецФункции

Функция ВернетИстина()
	
	Возврат
	Истина
	;
	
КонецФункции

	Инициализация();
	Присвоение();
