
Процедура ФункцииРаботаСоСтроками()
	Б = Новый Массив;
	Б.Добавить("А");

	А =
		СтрДлина("А");
	А =
		СокрЛ(" 1 ");
	А =
		СокрП(" 1 ");
	А =
		СтрДлина("1");
	А =
		СокрЛП(" 1 ");
	А =
		Лев("1", 1);
	А =
		Прав("1", 1);
	А =
		Сред("1", 1);
	А =
		СтрНайти("1", "1");
	А =
		ВРег("а");
	А =
		НРег("а");
	А =
		ТРег("а");
	А =
		Символ(34);
	А =
		КодСимвола("А");
	А =
		ПустаяСтрока("А");
	А =
		СтрЗаменить("А", "А", "");
	А =
		СтрЧислоСтрок("А");
	А =
		СтрПолучитьСтроку("А", 1);
	А =
		СтрЧислоВхождений("А", "А");
	А =
		СтрСравнить("А", "А");
	А =
		СтрНачинаетсяС("А", "А");
	А =
		СтрЗаканчиваетсяНа("А", "А");
	А =
		СтрРазделить("А,А",",");
	А =
		СтрСоединить(Б, ",");
	А =
		ПолучитьСклоненияСтроки("токарь третьего разряда", , "ПД=Дательный");
	А =
		ПолучитьСклоненияСтрокиПоЧислу("стул",
			12,
			"",
			"ЧС=Порядковое",
			"ПД=Родительный; ПЧ=ЧислоСОкончанием");
	А =
		СтрНайтиИВыделитьОформлением("А", "А");

КонецПроцедуры

// Платформенные методы красные
Процедура ФункцииРаботыСДатой()

	ТекущаяДата =
		ТекущаяДата();

	А =
		Год(ТекущаяДата);
	А =
		Месяц(ТекущаяДата);
	А =
		День(ТекущаяДата);
	А =
		Час(ТекущаяДата);
	А =
		Минута(ТекущаяДата);
	А =
		Секунда(ТекущаяДата);
	А =
		НачалоГода(ТекущаяДата);
	А =
		НачалоКвартала(ТекущаяДата);
	А =
		НачалоМесяца(ТекущаяДата);
	А =
		НачалоНедели(ТекущаяДата);
	А =
		НачалоДня(ТекущаяДата);
	А =
		НачалоЧаса(ТекущаяДата);
	А =
		НачалоМинуты(ТекущаяДата);
	А =
		КонецГода(ТекущаяДата);
	А =
		КонецКвартала(ТекущаяДата);
	А =
		КонецМесяца(ТекущаяДата);
	А =
		КонецНедели(ТекущаяДата);
	А =
		КонецДня(ТекущаяДата);
	А =
		КонецЧаса(ТекущаяДата);
	А =
		КонецМинуты(ТекущаяДата);
	А =
		НеделяГода(ТекущаяДата);
	А =
		ДеньГода(ТекущаяДата);
	А =
		ДеньНедели(ТекущаяДата);
	А =
		ДобавитьМесяц(ТекущаяДата, 1);

КонецПроцедуры

Процедура ФункцииПреобразованияЗначений()

	А =
		Булево("Истина");
	А =
		Число("1");
	А =
		Строка(1);
	А =
		Дата("19840326062421");
	А =
		ЧислоИзШестнадцатеричнойСтроки("0xabcde");
	А =
		ЧислоИзДвоичнойСтроки("0b101001111");

КонецПроцедуры

Процедура ФункцииТип(СоответствиеТипов);

Тип =
    Тип("Строка");

Тип =
    ТипЗнч("Строка");

СоответствиеТипов.Вставить(
Тип("Строка"), "Строка");

КонецПроцедуры


ФункцииРаботаСоСтроками();
ФункцииРаботыСДатой();
ФункцииПреобразованияЗначений();
ФункцииТип(Новый Соответствие);
