// Известные исключения


Процедура ЦиклБезЕдиногоПрохода()

	Для А = 0 По 1 Цикл
		Прервать;
	КонецЦикла // Будет всегда красная
КонецПроцедуры

Функция УсловияВсеВеткиВозврат(Условие)

	Если Условие Тогда
		Возврат 1;
	Иначе
		Возврат 1;
	КонецЕсли; // Будет всегда красная

КонецФункции

// Платформенные методы красные
Процедура ФункцииРаботаСоСтроками()

	А =
		Строка(1);
	А =
		СокрЛП(" 1 ");
	А =
		СокрЛ(" 1 ");
	А =
		СокрП(" 1 ");
	А =
		Число("1");
	А =
		СтрДлина("1");

КонецПроцедуры

// Платформенные методы красные
Процедура ФункцииРаботыСДатой()

	A =
		ТекущаяДата();
	A =
		Дата("19840326062421");

КонецПроцедуры

ЦиклБезЕдиногоПрохода();
УсловияВсеВеткиВозврат(Истина);
УсловияВсеВеткиВозврат(Ложь);
ФункцииРаботаСоСтроками();
ФункцииРаботыСДатой();