Процедура Проверить(Отказ, два = Ложь)

    Выполнить
    (
        "А = 
        | Цел(1)"
    );
    А = 
        СтрДлина("А");
    А = 
        СокрЛ(" А");
    А = 
        СокрП("А ");
    А = 
        СокрЛП(" А ");
    А = 
        Лев("А", 1);
    А = 
        Прав("А", 1);
    А = 
        Сред("А", 1);
    А = 
        Найти("А", "А");
    А = 
        Врег("А");
    А = 
        Нрег("А");
    А = 
        ТРег("А");
    А = 
        Символ(34);
    А = 
        КодСимвола("А");
    А = 
        ПустаяСтрока("А");
    А = 
        Цел(1);
    А = 
        Окр(1);
    А = 
        Булево(1);
    А = 
        Число("1");
    А = 
        Строка(1);
    Дата = 
        Дата(1, 1, 1);
    А = 
        ДобавитьМесяц(Дата, 1);
    А = 
        НачалоМесяца(Дата);
    А = 
        КонецМесяца(Дата);
    А = 
        НачалоКвартала(Дата);
    А = 
        КонецКвартала(Дата);
    А = 
        НачалоГода(Дата);
    А =
        КонецГода(Дата);
    А = 
        Год(Дата);
    А = 
        Месяц(Дата);
    А = 
        День(Дата);
    А = 
        Час(Дата);
    А = 
        Минута(Дата);
    А = 
        Секунда(Дата);
    А = 
        ДеньГода(Дата);
    А = 
        НеделяГода(Дата);
    А = 
        ДеньНедели(Дата);
    А = 
        НачалоНедели(Дата);
    А = 
        КонецНедели(Дата);
    А = 
        НачалоДня(Дата);
    А = 
        КонецДня(Дата);
    А = 
        НачалоЧаса(Дата);
    А = 
        КонецЧаса(Дата);
    А = 
        НачалоМинуты(Дата);
    А =   
        КонецМинуты(Дата);
    А = 
        ТекущаяДата();
    А = 
        СтрЗаменить("А", "А", "А");
    А = 
        СтрЧислоСтрок("А");
    А =     
        СтрПолучитьСтроку("А", 1);
    А = 
        Мин(1, 1);
    А =    
        Макс(1, 1);
    А =    
        СтрЧислоВхождений("А", "А");
    Попытка
        ВызватьИсключение "А";
    Исключение
        А = 
            ОписаниеОшибки();
        А = 
            ИнформацияОбОшибке();    
    КонецПопытки;

    А = 
        ТипЗнч(Дата);
    А = 
        Тип("Строка");
    А = 
        Вычислить("1 + 1");
    А = 
        Формат("1", "ДЛФ=Д");
    А = 
        Новый Массив;
    А =   
        ACos(1);
    А = 
        ASin(1);
    А =
        ATan(1);
    А =
        Cos(90);
    А = 
        Exp(1);
    А = 
        Log(1);
    А = 
        Log10(1);
    А = 
        Pow(1, 2);
    А = 
        Sin(90);
    А = 
        Sqrt(4);
    А = 
        Tan(90);
    
    ДобавитьОбработчик 
        Документы.Анкета.СоздатьДокумент().ПриЗаписи, 
         Проверить;
    УдалитьОбработчик 
        Документы.Анкета.СоздатьДокумент().ПриЗаписи, 
        Проверить;

КонецПроцедуры

Проверить(Ложь);