
Процедура ВыполнитьВыполнить()

	Выполнить
	(
	"Сообщить"
	+
	"("
	+
	ПараметрыСообщить
	(
	)
	+ ")"
	);
КонецПроцедуры

Процедура Тернариник()
	А = 1;
	Б = 2;

	Г
	=
	?
	(
	А
	=
	1
	,
	А
	,
	Б
	);

	Если
	?
	(
	А
	=
	1
	,
	А
	,
	Б
	)
	=
	А
	Тогда
	КонецЕсли;

КонецПроцедуры

Функция ПараметрыСообщить()
	Возврат
	"Истина";
КонецФункции

Процедура ПопыткаИсключение()

	А = "1";
	Попытка
		Сообщить(А);
		ВызватьИсключение А;
	Исключение
		А =
		КраткоеПредставлениеОшибки
		(
		ИнформацияОбОшибке()
		)
		;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура Ожидания()
	ПодключитьОбработчикОжидания(
		"ОбработчикОжидания",
		0.1,
		Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжидания() Экспорт
	ОтключитьОбработчикОжидания(
		"ОбработчикОжидания"
		);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ожидания();
КонецПроцедуры

ВыполнитьВыполнить();
Тернариник();
ПопыткаИсключение();
