Процедура ТекстЗапроса()

	Запрос
		=
		Новый
		Запрос;

	Запрос
	.Текст
	=
	"ВЫБРАТЬ
	|	1 КАК Поле1"
	;

КонецПроцедуры

Процедура ЦиклДляКаждого()
	А = Новый Массив;
	А.Добавить("0");
	А.Добавить("1");
	А.Добавить("2");

	В = А.Количество();
	Для
	Каждого
	Б
	Из
	А
	Цикл
	Если Б = "1" Тогда
		Продолжить;
	КонецЕсли;
	Если Б = "2" Тогда
		Возврат;
	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция Условие(А)

	Б = Новый Массив;
	Б
	.
	Добавить
	("1")
	;

	Если
	А
	= Б
	.Количество()
	Тогда
		Возврат
		Истина
		;
	Иначе
		Возврат
		Истина
		;
	КонецЕсли
	;

КонецФункции

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса();
	ЦиклДляКаждого();
	Условие(1);
	Условие(2);
КонецПроцедуры

ПриСозданииНаСервере(Ложь, Ложь);