
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НичегоНеДелать();
	ПроверитьЗаполнение();
	Статус = "Ожидание";
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ОбщийМодульВызовСервера.ПроцедураОбщегоМодуляВызовСервера();
	Команда1НаСервере();
	ПодключитьОбработчикОжидания("ОжидатьВыполнениеРегламентногоЗадания", 1, Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Команда1НаСервере()
	ОбщийМодульПовтИспВызов.ОбщегоМодуляПовтИспВызов();
	ОбщийМодульПовтИспСеанс.ПроцедураОбщегоМодуляПовтИспСеанс();
	ОбщийМодульПолныеПрава.ПроцедураОбщегоМодуляПолныеПрава();
	ПроцедураГлобальногоОбщегоМодуля();
	ФоновыеЗадания.Выполнить("ПростойОбщийМодуль.ФоновоеЗадание1");
КонецПроцедуры

&НаКлиенте
Процедура ОжидатьВыполнениеРегламентногоЗадания()
	Если РегламентноеЗаданиеВыполнено() Тогда
		ОтключитьОбработчикОжидания("ОжидатьВыполнениеРегламентногоЗадания");
		Статус = "Выполнено";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РегламентноеЗаданиеВыполнено()
	Возврат Константы.ДатаЗавершенияФоновогоЗадания.Получить() > ПараметрыСеанса.НачалоСеанса;
КонецФункции